app/controllers/hopes_controller.rb

  def index
    @hopes = Hope.order("created_at DESC").limit(3)
    @hope = Hope.new
    @count = Hope.count
---
SELECT `hopes`.* FROM `hopes` ORDER BY created_at DESC LIMIT 3
SELECT COUNT(*) FROM `hopes`

  def all
    @hopes = Hope.paginate(:page => params[:page], :per_page => 10).order('created_at DESC')
---
SELECT COUNT(*) FROM "hopes"
SELECT `hopes`.* FROM `hopes` ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @hope = Hope.find(params[:id])
---
SELECT "hopes".* FROM "hopes" WHERE "hopes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @hope = Hope.new(params[:hope])

    respond_to do |format|
      if @hope.save
---
INSERT INTO "hopes" ("created_at", "name", "say", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 01 Jan 2012 16:26:14 UTC +00:00], ["name", "test"], ["say", "test"], ["updated_at", Sun, 01 Jan 2012 16:26:14 UTC +00:00]]

    def manage
    @hopes = Hope.paginate(:page => params[:page], :per_page => 10).order('created_at DESC')
---
SELECT COUNT(*) FROM "hopes"
SELECT `hopes`.* FROM `hopes` ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def destroy
    @hope = Hope.find(params[:id])
    @hope.destroy
---
SELECT "hopes".* FROM "hopes" WHERE "hopes"."id" = ? LIMIT 1  [["id", "17"]]
DELETE FROM "hopes" WHERE "hopes"."id" = ?  [["id", 17]]